from GP_FSA.core.account import Regist_this_to_account_list

# 자산부채표의 자산면--------------------------------------------------
류동자산면 = ('流动资产合计',           'col21',  [
                ('货币资金',            'col8'),
                ('结算备付金',          'col402', 10000),
                ('拆出资金',            'col403', 10000),
                ('发放贷款及垫款_CA',  'col404', 10000),
                ('交易性金融资产',      'col9'),
                ('衍生金融资产',        'col405', 10000),
                ('应收票据及应收账款_CA', 'col296', [
                    ('应收票据',        'col10'),
                    ('应收账款',        'col11'),
                ]),
                ('应收款项融资',        'col437', 10000),
                ('预付款项',            'col12'),
                #  融出资金
                ('应收保费',            'col406', 10000),
                ('应收分保账款',        'col407', 10000),
                ('应收分保合同准备金',  'col408', 10000),
                ('其他应收款',          'col13'),
                    ('应收关联公司款',  'col14'),
                    ('应收利息',        'col15'),
                    ('应收股利',        'col16'),
                ('买入返售金融资产',     'col409', 10000),
                ('存货',                'col17', [
                    ('消耗性生物资产',  'col18'),
            ]
         ),
        ('合同资产',            'col435', 10000),
        #  '其他资产', 'col436',
        ('划分为持有待售的资产', 'col410'),
        ('一年内到期的非流动资产', 'col19'),
        ('其他流动资产',        'col20'),
    ])


비류동자산면 = ( '非流动资产合计',       'col39', [
        ('发放贷款及垫款_NCA', 'col411', 10000),
        ('债权投资',            'col430', 10000),
        ('其他债权投资',        'col431', 10000),
        ('长期应收款',          'col24'),
        ('长期股权投资',         'col25'),
        ('其他权益工具投资',     'col432', 10000),
        ('其他非流动金融资产',   'col433', 10000),
        ('投资性房地产',        'col26'),
        ('固定资产',            'col27'),
        ('在建工程',            'col28'),
        ('工程物资',            'col29'),
        ('固定资产清理',        'col30'),
        ('生产性生物资产',      'col31'),
        ('油气资产',            'col32'),
        ('使用权资产',          'col438', 10000),
        ('无形资产',            'col33'),
        ('开发支出',            'col34'),
        ('商誉',                'col35'),
        ('长期待摊费用',        'col36'),
        ('递延所得税资产',      'col37'),
        ('可供出售金融资产',    'col22'),
        ('持有至到期投资',      'col23'),
        ('其他非流动资产',      'col38'),
    ])
ASSET = ('资产总计', 'col40',  [류동자산면, 비류동자산면])
Regist_this_to_account_list(ASSET)



# 자산부채표의 부채면---------------------------------------------
류동부채면 = ('流动负债合计', 'col54', [
    ('短期借款', 'col41'),
    ('向中央银行借款', 'col412', 10000),
    ('吸收存款及同业存放', 'col413', 10000),
    ('拆入资金', 'col414', 10000),
    ('交易性金融负债', 'col42'),
    ('衍生金融负债', 'col415', 10000),
    ('应付票据及应付账款_CL', 'col295', [
        ('应付票据', 'col43'),
        ('应付账款', 'col44'),        
    ]),
    ('预收款项', 'col45'),
    ('合同负债', 'col434', 10000),
    ('卖出回购金融资产款', 'col416', 10000),
    ('代理买卖证券款', 'col420', 10000),
    ('代理承销证券款', 'col421', 10000),
    ('应付职工薪酬', 'col46'),
    ('应交税费', 'col47'),
    ('其他应付款', 'col50', [
        ('应付利息', 'col48'),
        ('应付股利', 'col49'),
    ]),
    ('应付手续费及佣金', 'col417', 10000),
    ('应付分保账款', 'col418', 10000),
    # 内部应付款
    # 预计流动负债
    # 应付短期债券
    ('划分为持有待售的负债', 'col422', 10000),
    ('一年内到期的非流动负债', 'col52'),
    ('应付关联公司款', 'col51'),
    ('其他流动负债', 'col53'),
])




비류동부채면 = ('非流动负债合计', 'col62', [
    ('保险合同准备金', 'col419', 10000),
    ('长期借款', 'col55'),
    ('应付债券', 'col56', [
        ('应付债券_优先股', 'col425', 10000),
        ('应付债券_永续债', 'col426', 10000),        
    ]),
    ('租赁负债', 'col439', 10000),
    ('长期应付款', 'col57'),
    ('长期应付职工薪酬', 'col427', 10000),
    ('预计负债', 'col59'),
    #  '预计负债', 'col423',
    ('递延收益_NCL', 'col297'),
    ('递延所得税负债', 'col60'),
    ('其他非流动负债', 'col61'),
    # 以摊余成本计量的金融负债_非流动
    ('专项应付款', 'col58')
])
LIAB = ('负债合计', 'col63', [류동부채면, 비류동부채면])

# 자산부채표의 소유자권익면 ---------------------------------------------
归属于母公司股东权益 = ('归属于母公司股东权益总计',  'col271', [
    ('实收资本',  'col64'),
    ('其他权益工具_EQ',  'col299', [
        ('优先股_EQ',  'col428', 10000),
        ('永续债_EQ',  'col429', 10000),        
    ]),
    #         其他权益工具其中, 其他权益工具    OTHER_EQUITY_OTHER
    ('资本公积',  'col65'),
    ('库存股',  'col67',  -1),
    ('盈余公积',  'col66'),
    ('专项储备',  'col401', 10000),
    ('一般风险准备_金融类',  'col268'),
    ('未分配利润',  'col68'),
    ('其他综合收益_EQ',  'col298'),
    # 未确定的投资损失
    # 拟分配现金股利
    ('外币报表折算价差',  'col70'),
    ('非正常经营项目收益调整',  'col71')
])


少数股东权益 = ('少数股东权益_EQ',  'col69')
EQUATY = ('股东权益合计', 'col72', [归属于母公司股东权益, 少数股东权益])
Regist_this_to_account_list(('负债和股东权益合计',  'col73',[LIAB, EQUATY]))
