from GP_FSA import accounts
from GP_FSA.core.account import Acc, Regist_this_to_account_list

OP_IN = ('经营活动现金流入小计',  'col101', [
    ('销售商品提供劳务收到的现金', 'col98'),
    ('客户存款和同业存放款项净增加额', 'col562', 10000),
    ('向中央银行借款净增加额', 'col563', 10000),
    ('向其他金融机构拆入资金净增加额', 'col564', 10000),
    ('收到原保险合同保费取得的现金', 'col565', 10000),
    ('收到再保险业务现金净额', 'col566', 10000),
    ('保户储金及投资款净增加额', 'col567', 10000),
    ('收取利息手续费及佣金的现金', 'col569', 10000),
    ('拆入资金净增加额', 'col570', 10000),
    ('回购业务资金净增加额', 'col571', 10000),
    # 代理买卖证券收到的现金净额
    ('收到的税费返还', 'col99'),
    ('收到其他与经营活动有关的现金', 'col100'),

    # 处置交易性金融资产净增加额
    ('处置以公允价值计量且其变动计入当期损益的金融资产净增加额', 'col568', 10000),
    # 发放贷款及垫款的净减少额
])
Regist_this_to_account_list(OP_IN)




OP_OUT = ('经营活动现金流出小计',  'col106', [
    ('购买商品接受劳务支付的现金', 'col102'),
    ('客户贷款及垫款净增加额', 'col572', 10000),
    ('存放中央银行和同业款项净增加额', 'col573', 10000),
    ('支付原保险合同赔付款项的现金', 'col574', 10000),
    # 拆出资金净增加额
    ('支付利息手续费及佣金的现金', 'col575', 10000),
    ('支付保单红利的现金', 'col576', 10000),
    ('支付给职工以及为职工支付的现金', 'col103'),
    ('支付的各项税费', 'col104'),
    ('支付其他与经营活动有关的现金', 'col105'),
])
Regist_this_to_account_list(OP_OUT)



OP = ('经营活动产生的现金流量净额',  'col107', [
    (accounts['经营活动现金流入小计'], 1),
    (accounts['经营活动现金流出小计'], 1),
])
Regist_this_to_account_list(OP)


# ------------------------------------------------------
INVEST_IN = ('投资活动现金流入小计',  'col113', [
    ('收回投资收到的现金', 'col108'),
    ('取得投资收益收到的现金', 'col109'),
    ('处置固定资产无形资产和其他长期资产收回的现金净额', 'col110'),
    ('处置子公司及其他营业单位收到的现金净额', 'col111'),
    # 减少质押和定期存款所收到的现金
    ('收到其他与投资活动有关的现金', 'col112'),
])
Regist_this_to_account_list(INVEST_IN)
INVEST_OUT = ('投资活动现金流出小计', 'col118', [
    ('购建固定资产无形资产和其他长期资产支付的现金', 'col114'),
    ('投资支付的现金', 'col115'),
    # 质押贷款净增加额
    ('取得子公司及其他营业单位支付的现金净额', 'col116'),
    # 增加质押和定期存款所支付的现金
    ('支付其他与投资活动有关的现金', 'col117'),
])
Regist_this_to_account_list(INVEST_OUT)
INVEST = ('投资活动产生的现金流量净额',  'col119', [
    (accounts['投资活动现金流入小计'], 1),
    (accounts['投资活动现金流出小计'], 1),
])
Regist_this_to_account_list(INVEST)





# ------------------------------------------------------
FIN_IN = ('筹资活动现金流入小计',  'col123', [
    ('吸收投资收到的现金', 'col120', [
        ('子公司吸收少数股东投资收到的现金', 'col577', 10000),
    ]),
    ('取得借款收到的现金', 'col121'),
    # 发行债券收到的现金
    ('收到其他与筹资活动有关的现金', 'col122'),
])
Regist_this_to_account_list(FIN_IN)


FIN_OUT = ('筹资活动现金流出小计', 'col127', [
    ('偿还债务支付的现金', 'col124'),
    ('分配股利利润或偿付利息支付的现金', 'col125', [
        ('子公司支付给少数股东的股利利润', 'col578', 10000),
    ]),
    # 购买子公司少数股权而支付的现金
    ('支付其他与筹资活动有关的现金', 'col126'),
    # 其中_子公司减资支付给少数股东的现金
])


Regist_this_to_account_list(FIN_OUT)
FIN = ('筹资活动产生的现金流量净额',  'col128', [
    (accounts['筹资活动现金流入小计'], 1),
    (accounts['筹资活动现金流出小计'], 1)
])
Regist_this_to_account_list(FIN)


Regist_this_to_account_list(('汇率变动对现金的影响', 'col129'))
Regist_this_to_account_list(('其他原因对现金的影响', 'col130'))

CCE_ADD = ('现金及现金等价物净增加额', 'col131', [
    (accounts['经营活动产生的现金流量净额'], 1),
    (accounts['投资活动产生的现金流量净额'], 1),
    (accounts['筹资活动产生的现金流量净额'], 1),
    (accounts['汇率变动对现金的影响'], 1),
    (accounts['其他原因对现金的影响'], 1),
])
Regist_this_to_account_list(CCE_ADD)

CCE = ('期末现金及现金等价物余额', 'col133', [
    ('期初现金及现金等价物余额', 'col132'),
    (accounts['现金及现金等价物净增加额'], 1),
])
Regist_this_to_account_list(CCE)
