from GP_FSA.core.account import Acc, Regist_this_to_account_list

OP_PROFIT = ('营业利润',  'col86', [
    ('营业总收入',  'col502', 10000, [
        # ('营业收入',  'col230'),
        ('营业总收入_营业收入',  'col74'),
        ('营业总收入_利息收入',  'col506', 10000),
        ('营业总收入_已赚保费',  'col507', 10000),
        ('营业总收入_手续费及佣金收入',  'col508', 10000),
        # 其他业务收入
        # 营业总收入其他项目
        # ('营业总收入TTM(万元)',  'col319', 10000),    
    ]), 
    ('营业总成本', 'col519', 10000, [
        ('营业成本',  'col75'),
        ('利息支出',  'col509', 10000),
        ('手续费及佣金支出',  'col510', 10000),
        ('退保金',  'col511', 10000),
        ('赔付支出净额',  'col512', 10000),
        ('提取保险合同准备金净额',  'col513', 10000),
        ('保单红利支出',  'col514', 10000),
        # 其他业务成本
        ('分保费用',  'col515', 10000),
        ('营业税金及附加',  'col76'),
        ('销售费用',  'col77'),
        ('管理费用',  'col78'),
        ('研发费用_IS',  'col304'),
        ('勘探费用',  'col79'),
        ('财务费用_IS',  'col80', [
            ('财务费用_利息费用',  'col305'),
            ('财务费用_利息收入',  'col306'),            
        ]),
        # 营业总成本其他项目    
        ('资产减值损失',  'col81'),
        ('加：公允价值变动净收益',  'col82'),
        ('信用减值损失',  'col580', 10000),

        # (),
    ]),
    ('其他收益_IS',  'col300'),
    ('投资收益',  'col83', [
        ('投资收益_对联营企业和合营企业的投资收益',  'col84'),
    ]),
    ('汇兑收益',  'col503', 10000),
    ('净敞口套期收益',  'col518', 10000),
    # 公允价值变动收益
    ('信用减值损失2019',  'col520', 10000),
    ('资产减值损失2019',  'col521', 10000),
    ('资产减值损失', 'col81'),
    ('信用减值损失', 'col580', 10000),
    ('资产处置收益_IS',  'col301'),
    ('补贴收入',  'col87'),
    ('影响营业利润的其他科目',  'col85'),
])
Regist_this_to_account_list(OP_PROFIT)

PROFIT = ('利润总额',  'col92', [
    ('营业利润',  'col86'),
    ('营业外收入',  'col88'),
    ('营业外支出',  'col89', -1),
    ('影响利润总额的其他科目',  'col91'),
])
Regist_this_to_account_list(PROFIT)

NP = ('净利润',  'col95', [
    ('利润总额',  'col92'),
    ('所得税',  'col93', 1),
    ('影响净利润的其他科目',  'col94')
])
Regist_this_to_account_list(NP)

# '其中：非流动资产处置净损失',  'col90',
# #  '其中, 非流动资产处置利得(万元)',  'col516', 10000,


 

#  扣除非经常性损益后的净利润
# #     其中, 被合并方在合并前实现利润 	 PRECOMBINE_PROFIT



# #     1.按经营持续性分类 	 
Regist_this_to_account_list(('持续经营净利润',  'col302'))
Regist_this_to_account_list(('终止经营净利润',  'col303'))
# #     2.按所有权归属分类 
Regist_this_to_account_list(('归属于母公司股东的净利润',  'col96'))
Regist_this_to_account_list(('少数股东损益',  'col97'))

Regist_this_to_account_list(('归属于母公司股东的其他综合收益的税后净额',  'col269', 10000))
Regist_this_to_account_list(('归属于少数股东的其他综合收益的税后净额',  'col268', 10000))

Regist_this_to_account_list(('综合收益总额',  'col270', [
    ('归属于母公司综合收益',  'col504', 10000),
    ('归属于少数股东综合收益',  'col505', 10000)
]))


Regist_this_to_account_list(('基本每股收益', 'col1'))
Regist_this_to_account_list(('扣除非经常性损益每股收益', 'col2'))
Regist_this_to_account_list(('稀释每股收益', 'col501'))


