from GP_FSA.core.account import Acc, Regist_this_to_account_list
from GP_KDB import KDB
import pandas

ratios = [
    ('基本每股收益', 'col1'),
    ('扣除非经常性损益每股收益', 'col2'),
    ('每股未分配利润', 'col3'),
    ('每股净资产', 'col4'),
    ('每股资本公积金', 'col5'),
    ('净资产收益率', 'col197'),
    ('每股经营现金流量', 'col7'),
    ('流动比率T非金融', 'col159'),
    ('速动比率T非金融', 'col160'),
    ('现金比率TpctT非金融', 'col161'),
    ('利息保障倍数T非金融', 'col162'),
    ('非流动负债比率TpctT非金融', 'col163'),
    ('流动负债比率TpctT非金融', 'col164'),
    ('现金到期债务比率TpctT非金融', 'col165'),
    ('有形资产净值债务率Tpct', 'col166'),
    ('权益乘数Tpct', 'col167'),
    ('股东的权益_负债合计Tpct', 'col168'),
    ('有形资产_负债合计Tpct', 'col169'),
    ('经营活动产生的现金流量净额_负债合计TpctT非金融', 'col170'),
    ('EBITDA_负债合计TpctT非金融', 'col171'),
    ('应收帐款周转率T非金融', 'col172'),
    ('存货周转率T非金融', 'col173'),
    ('运营资金周转率T非金融', 'col174'),
    ('总资产周转率T非金融', 'col175'),
    ('固定资产周转率T非金融', 'col176'),
    ('应收帐款周转天数T非金融', 'col177'),
    ('存货周转天数T非金融', 'col178'),
    ('流动资产周转率T非金融', 'col179'),
    ('流动资产周转天数T非金融', 'col180'),
    ('总资产周转天数T非金融', 'col181'),
    ('股东权益周转率T非金融', 'col182'),
    ('营业收入增长率Tpct', 'col183'),
    ('净利润增长率Tpct', 'col184'),
    ('净资产增长率Tpct', 'col185'),
    ('固定资产增长率Tpct', 'col186'),
    ('总资产增长率Tpct', 'col187'),
    ('投资收益增长率Tpct', 'col188'),
    ('营业利润增长率Tpct', 'col189'),
    ('扣非每股收益同比Tpct', 'col190'),
    ('扣非净利润同比Tpct', 'col191'),
    ('成本费用利润率Tpct', 'col193'),
    ('营业利润率T非金融', 'col194'),
    ('营业税金率T非金融', 'col195'),
    ('营业成本率T非金融', 'col196'),
    ('投资收益率', 'col198'),
    ('销售净利率Tpct', 'col199'),
    ('总资产报酬率', 'col200'),
    ('净利润率T非金融', 'col201'),
    ('销售毛利率TpctT非金融', 'col202'),
    ('三费比重T非金融', 'col203'),
    ('管理费用率T非金融', 'col204'),
    ('财务费用率T非金融', 'col205'),
    ('扣除非经常性损益后的净利润', 'col233'),
    ('息税前利润_EBIT', 'col207'),
    ('息税折旧摊销前利润_EBITDA', 'col208'),
    ('EBITDA_营业总收入TpctT非金融', 'col209'),
    ('资产负债率Tpct', 'col210'),
    ('流动资产比率T非金融', 'col211'),
    ('货币资金比率T非金融', 'col212'),
    ('存货比率T非金融', 'col213'),
    ('固定资产比率', 'col214'),
    ('负债结构比T非金融', 'col215'),
    ('归属于母公司股东权益_全部投入资本Tpct', 'col216'),
    ('股东的权益_带息债务Tpct', 'col217'),
    ('有形资产_净债务Tpct', 'col218'),
    ('每股经营性现金流', 'col219'),
    ('营业收入现金含量TpctT非金融', 'col220'),
    ('经营活动产生的现金流量净额_经营活动净收益Tpct', 'col221'),
    ('销售商品提供劳务收到的现金_营业收入Tpct', 'col222'),
    ('经营活动产生的现金流量净额_营业收入', 'col223'),
    ('资本支出_折旧和摊销', 'col224'),
    ('每股现金流量净额', 'col225'),
    ('经营净现金比率_短期债务T非金融', 'col226'),
    ('经营净现金比率_全部债务', 'col227'),
    ('经营活动现金净流量与净利润比率', 'col228'),
    ('全部资产现金回收率', 'col229'),
    ('银行机构数', 'col272'),
    ('银行持股量', 'col273'),
    ('一般法人机构数', 'col274'),
    ('一般法人持股量', 'col275'),
    ('信托机构数', 'col277'),
    ('信托持股量', 'col278'),
    ('特殊法人机构数', 'col279'),
    ('特殊法人持股量', 'col280'),
    ('加权净资产收益率_每股', 'col281'),
    ('扣非每股收益_单季度', 'col282'),
    ('基本每股收益_单季度', 'col311'),
    ('每股企业自由现金流', 'col321'),
    ('每股股东自由现金流', 'col322'),
    ('稀释每股收益', 'col501'),
]

for e in ratios:
    Acc(e[0]).Col(e[1])

def ratioTable(IDE):
    cols = ['IDE', 'REPORTDATE']; 
    colnames = {}
    for e in ratios:
        cols.append(e[1])
        colnames[e[1]] = e[0]

    query = KDB().col_TDX_CW.find( {'IDE':IDE},  cols).sort([('REPORTDATE', 1)])
    df = pandas.DataFrame(
        [x for x in query]
    ).drop(columns=['_id'])
    df = df[cols].set_index('REPORTDATE').rename(columns=colnames)
    return df.T


