from GP_FSA.core.account import Acc, Regist_this_to_account_list
Regist_this_to_account_list(
    ('总股本', 'col238', [
        ('已上市流通A股', 'col239'),
        ('已上市流通B股', 'col240'),
        ('已上市流通H股', 'col241'),
        ('自由流通股(股)', 'col266'),
        ('受限流通A股(股)', 'col267'),
    ])
)

Regist_this_to_account_list(
    ('股东人数', 'col242', [
        ('第一大股东的持股数量', 'col243'),
        ('十大流通股东持股数量合计#股', 'col244'),
        ('十大股东持股数量合计#股', 'col245'),
        ('机构总量#家', 'col246'),
        ('机构持股总量#股', 'col247'),
        ('QFII机构数', 'col248'),
        ('QFII持股量', 'col249'),
        ('券商机构数', 'col250'),
        ('券商持股量', 'col251'),
        ('保险机构数', 'col252'),
        ('保险持股量', 'col253'),
        ('基金机构数', 'col254'),
        ('基金持股量', 'col255'),
        ('社保机构数', 'col256'),
        ('社保持股量', 'col257'),
        ('私募机构数', 'col258'),
        ('私募持股量', 'col259'),
        ('财务公司机构数', 'col260'),
        ('财务公司持股量', 'col261'),
        ('年金机构数', 'col262'),
        ('年金持股量', 'col263'),
        ('十大流通股东中持有A股合计#股', 'col264'),
        ('第一大流通股东持股量#股', 'col265'),
        ('银行机构数#家#机构持股', 'col272'),
        ('银行持股量#股#机构持股', 'col273'),
        ('一般法人机构数#家#机构持股', 'col274'),
        ('一般法人持股量#股#机构持股', 'col275'),
        ('信托机构数#家#机构持股', 'col277'),
        ('信托持股量#股#机构持股', 'col278'),
        ('特殊法人机构数#家#机构持股', 'col279'),
        ('特殊法人持股量#股#机构持股', 'col280'),
        ('国家队持股数量#万股', 'col284'),
    ])
)




